#include "../template/head.h"
#include <bits/stdc++.h>

int numRookCaptures(vector<vector<char>> board) {
    // 思路：模拟
    // 时间 O(n2)，空间 O(1)
    // 先找到位置
    int n = board.size(), pi = -1, pj = -1;
    auto getPos = [&]() {
        for (int i = 0; i < n; i++) {
            for (int j = 0; j < n; j++) {
                if (board[i][j] == 'R') {
                    pi = i;
                    pj = j;
                    return;
                }
            }
        }
    };

    getPos();
    int num = 0;
    vector<vector<int>> mov{{-1, 0}, {1, 0}, {0, -1}, {0, 1}};
    for (int i = 0; i < mov.size(); i++) {
        int ti = pi, tj = pj;
        while (true) {
            ti += mov[i][0];
            tj += mov[i][1];
            if (!(ti >= 0 && ti < n && tj >= 0 && tj < n)) {
                break;
            }

            if (board[ti][tj] == '.') {
                continue;
            } else if (board[ti][tj] == 'p') {
                num++;
                break;
            } else {
                break;
            }
        }
    }

    return num;
}

int main(int argc, char *argv[]) {
    // 3
    cout << numRookCaptures({{'.', '.', '.', '.', '.', '.', '.', '.'},
                             {'.', '.', '.', 'p', '.', '.', '.', '.'},
                             {'.', '.', '.', 'R', '.', '.', '.', 'p'},
                             {'.', '.', '.', '.', '.', '.', '.', '.'},
                             {'.', '.', '.', '.', '.', '.', '.', '.'},
                             {'.', '.', '.', 'p', '.', '.', '.', '.'},
                             {'.', '.', '.', '.', '.', '.', '.', '.'},
                             {'.', '.', '.', '.', '.', '.', '.', '.'}})
         << endl;
    // 0
    cout << numRookCaptures({{'.', '.', '.', '.', '.', '.', '.', '.'},
                             {'.', 'p', 'p', 'p', 'p', 'p', '.', '.'},
                             {'.', 'p', 'p', 'B', 'p', 'p', '.', '.'},
                             {'.', 'p', 'B', 'R', 'B', 'p', '.', '.'},
                             {'.', 'p', 'p', 'B', 'p', 'p', '.', '.'},
                             {'.', 'p', 'p', 'p', 'p', 'p', '.', '.'},
                             {'.', '.', '.', '.', '.', '.', '.', '.'},
                             {'.', '.', '.', '.', '.', '.', '.', '.'}})
         << endl;
    // 3
    cout << numRookCaptures({{'.', '.', '.', '.', '.', '.', '.', '.'},
                             {'.', '.', '.', 'p', '.', '.', '.', '.'},
                             {'.', '.', '.', 'p', '.', '.', '.', '.'},
                             {'p', 'p', '.', 'R', '.', 'p', 'B', '.'},
                             {'.', '.', '.', '.', '.', '.', '.', '.'},
                             {'.', '.', '.', 'B', '.', '.', '.', '.'},
                             {'.', '.', '.', 'p', '.', '.', '.', '.'},
                             {'.', '.', '.', '.', '.', '.', '.', '.'}})
         << endl;

    return 0;
}
